package 课堂练习.ch04_循环高级用法.ch03_循环嵌套;

/**
 * ClassName: ch06_打印99乘法表
 * Package: 课堂练习.ch04_循环高级用法.ch03_循环嵌套
 * Description:
 *
 * @Author:锏澹
 * @Create: 2026/4/27 - 16:35
 * @Version: v1.0
 *
 */
public class ch06_打印99乘法表 {
	public static void main(String[] args){
		/*
		打印九九乘法表
		1*1=1
		1*2=2 2*2=4
		1*3=3 2*3=6 3*3=9
		1*4=4 2*4=8 3*4=12 4*4=16
		1*5=5 2*5=10 3*5=154*5=20 5*5=25
		1*6=6 2*6=12 3*6=18 4*6=24 5*6=306*6=36
		1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
		1*8=8 2*8=16 3*8=244*8=32 5*8=406*8=48 7*8=56 8*8=64
		1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81
		*/
		for (int i = 1; i <= 9; i++) {  //外循环 行数 就是9
			for (int j = 1; j <= i; j++){
				System.out.print(j + "*" + i + "=" + i * j + "\t");
			}
			System.out.println();
		}
	}
}
