package ch01_课堂代码.ch02_数组的静态初始化;


/*
    按照要求定义数组，数组中的数据任意书写
    1.定义数组存储3位同学的年龄     整数
    2.定义数组存储5位同学的身高     小数
    3.定义数组存储3位同学的名字     字符串

        静态初始化
            完整格式：
                数据类型[] 数组名= new 数据类型[]{元素1,元素2,元素3,...，元素n}；

            简写格式：
                数据类型[] 数组名 = {元素1，元素2，元素3，.，元素n}；
*/
public class ch01_数组静态初始化 {
    public static void main(String [] args){
        //1. 定义数组存储3位同学的年龄
        int[] ageArr1 = new int[] {19,20,25};                          //整数
        int[] ageArr2 = {19,20,25};
        //2. 定义数组存储5位同学的身高
        double[] heightArr1 = new double[]{1.75,1.80,1.65,1.70,1.85};  //小数
        double[] heightArr2 = {1.75,1.80,1.65,1.70,1.85};
        //3.定义数组存储3位同学的名字
        String[] nameArr1 = new String[] {"张三","李四","王五"};        //字符串
        String[] nameArr2 = {"张三","李四","王五"};
    }
}
